In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("raw_sales_data.csv")

In [3]:
df.info

<bound method DataFrame.info of        order_id  order_date customer_id    customer_name          product  \
0          1000  2024-02-10        C126     Arthur Bowen           Laptop
1          1001  07/02/2024        C112      Jason Smith           Laptop
2          1002  15/01/2024        C446              NaN   Vacuum Cleaner
3          1003  2024-01-10        C048  Jennifer Romero  Air Conditioner
4          1004  16/02/2024        C473       Amy Phelps        Microwave
...         ...         ...         ...              ...              ...
10495      6170  20/02/2024        C292    Diana Mendoza           Laptop
10496      8205  2024-01-22        C105       Laura King          Toaster
10497      3522  04/01/2024        C457    Henry Shannon          Laptop
10498      3215  2024-01-30        C284     Hannah Jones          Camera
10499      7968  19/01/2024        C060    Tina Thompson           Laptop

              category  quantity  unit_price  country           created_at
0          Electronics         5         850      UK   2025-11-01 22:24:47
1          Electronics         5         850   France  2025-12-07 08:03:32
2      Home Appliances         3         250    China  2025-11-18 22:42:05
3      Home Appliances         3        1500      USA  2025-12-01 21:28:40
4      Home Appliances         5         300      UAE  2025-11-15 19:15:55
...                ...       ...         ...      ...                  ...
10495      electronics         4         850    China  2025-11-04 05:02:01
10496  home appliances         2          40    India  2025-11-09 11:11:23
10497      Electronics         3         850      UK   2025-12-19 01:38:04
10498      Electronics         2         650    China  2025-12-18 22:59:27
10499      Electronics         5         850  Nigeria  2025-12-09 13:54:17

[10500 rows x 10 columns]>

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10500 entries, 0 to 10499
Data columns (total 10 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       10500 non-null  int64
 1   order_date     10500 non-null  object
 2   customer_id    10500 non-null  object
 3   customer_name  9648 non-null   object
 4   product        10500 non-null  object
 5   category       10500 non-null  object
 6   quantity       10500 non-null  int64
 7   unit_price     10500 non-null  int64
 8   country        10500 non-null  object
 9   created_at     10500 non-null  object
dtypes: int64(3), object(7)
memory usage: 820.4+ KB

In [5]:
df.head(5)

,order_id,order_date,customer_id,customer_name,product,category,quantity,unit_price,country,created_at
0,1000,2024-02-10,C126,Arthur Bowen,Laptop,Electronics,5,850,UK,2025-11-01 22:24:47
1,1001,07/02/2024,C112,Jason Smith,Laptop,Electronics,5,850,France,2025-12-07 08:03:32
2,1002,15/01/2024,C446,NaN,Vacuum Cleaner,Home Appliances,3,250,China,2025-11-18 22:42:05
3,1003,2024-01-10,C048,Jennifer Romero,Air Conditioner,Home Appliances,3,1500,USA,2025-12-01 21:28:40
4,1004,16/02/2024,C473,Amy Phelps,Microwave,Home Appliances,5,300,UAE,2025-11-15 19:15:55

In [6]:
df.tail(5)

,order_id,order_date,customer_id,customer_name,product,category,quantity,unit_price,country,created_at
10495,6170,20/02/2024,C292,Diana Mendoza,Laptop,electronics,4,850,China,2025-11-04 05:02:01
10496,8205,2024-01-22,C105,Laura King,Toaster,home appliances,2,40,India,2025-11-09 11:11:23
10497,3522,04/01/2024,C457,Henry Shannon,Laptop,Electronics,3,850,UK,2025-12-19 01:38:04
10498,3215,2024-01-30,C284,Hannah Jones,Camera,Electronics,2,650,China,2025-12-18 22:59:27
10499,7968,19/01/2024,C060,Tina Thompson,Laptop,Electronics,5,850,Nigeria,2025-12-09 13:54:17

In [7]:
pip install sqlalchemy psycopg2-binary

Requirement already satisfied: sqlalchemy in c:\users\dell\anaconda3\lib\site-packages (2.0.39)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: psycopg2-binary in c:\users\dell\anaconda3\lib\site-packages (2.9.11)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\dell\anaconda3\lib\site-packages (from sqlalchemy) (3.1.1)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\dell\anaconda3\lib\site-packages (from sqlalchemy) (4.12.2)

In [8]:
from sqlalchemy import create_engine

engine = create_engine(
    "postgresql+psycopg2://postgres:%40Dsa2024@localhost:5432/sales_raw"
)

In [9]:
with engine.connect() as conn:
    print("Connected successfully!")

Connected successfully!

In [10]:
df.to_sql(
    "sales_raw",
    engine,
    if_exists="replace",
    index=False
)

500